#+TITLE: Issue 3

* Simple Test
** Project A
*** Task on project A
    :LOGBOOK:
    CLOCK: [2017-03-25 Sat 14:46]--[2017-03-25 Sat 18:25] =>  3:39
    :END:

* Test task with no headline ancestors
  :LOGBOOK:
  CLOCK: [2017-03-21 Tue 17:51]--[2017-03-22 Wed 02:51] =>  9:00
  :END:

* Test missing 3rd level headline
** Level 2
**** Level 4
***** task
      :LOGBOOK:
      CLOCK: [2012-11-29 13:05]--[2012-11-29 16:56] =>  3:51
      :END:

* Test Some commas within the headlines
** Are, found
*** Within, the,
**** task ancestor's
     :LOGBOOK:
     CLOCK: [2017-03-24 Fri 15:16]--[2017-03-24 Fri 19:16] =>  4:00
     CLOCK: [2017-03-25 Sat 17:16]--[2017-03-25 Sat 19:16] =>  2:00
     :END:

